//מערך הקטגוריות
let categories = [

    {
        id: 1,
        name: "שמפו יבש",
        image: "../images/categories/6.webp"
    },
    {
        id: 2,
        name: "שמפו + מרכך",
        image: "../images/categories/5.webp"
    },
    {
        id: 3,
        name: "מסכות + הזנה",
        image: "../images/categories/3.webp"
    },
    {
        id: 4,
        name: "הגנה מחום",
        image: "../images/categories/2.webp"
    },
    {
        id: 5,
        name: "מכשירי חשמל",
        image: "../images/categories/1.webp"
    },
    {
        id: 6,
        name: "קיטים ומתנות",
        image: "../images/categories/4.webp"
    }
];

//מערך המוצרים
let products = [
    {
        id: 1,
        categoryId: 1,
        name: "שמפו יבש אולטרה Perk Up Ultra",
        price: 189,
        image: "../images/DryShampoo/4.webp",
        Text: "שמפו יבש אולטרה לניקוי עוצמתי בין חפיפות, הפתרון האולטימטיבי לקרקפת שומנית.",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "87% מהמשתמשים העידו כי שמפו יבש אולטרה מסייע לאזן את השומניות בשיער*",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "

    },
    {
        id: 2,
        categoryId: 1,
        name: "שמפו יבש Perk Up – 150g / 189ml ",
        price: 189,
        image: "../images/DryShampoo/2.webp",
        Text: "שמפו יבש אולטרה לניקוי עוצמתי בין חפיפות, הפתרון האולטימטיבי לקרקפת שומנית.",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "87% מהמשתמשים העידו כי שמפו יבש אולטרה מסייע לאזן את השומניות בשיער*",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "

    },
    {
        id: 3,
        categoryId: 1,
        name: "שמפו יבש Perk Up – 269g / 358ml – אריזת חיסכון",
        price: 129,
        image: "../images/DryShampoo/3.webp",
        Text: "שמפו יבש אולטרה לניקוי עוצמתי בין חפיפות, הפתרון האולטימטיבי לקרקפת שומנית.",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "87% מהמשתמשים העידו כי שמפו יבש אולטרה מסייע לאזן את השומניות בשיער*",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "

    },
    {
        id: 4,
        categoryId: 2,
        name: "big hit שמפו להענקת נפח לשיער",
        price: 129.00,
        image: "../images/ShampooAndConditioner/1.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "

    },
    {
        id: 5,
        categoryId: 2,
        name: "normcore שמפו – 275ml",
        price: 129,
        image: "../images/ShampooAndConditioner/2.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 6,
        categoryId: 2,
        name: "Bust your brass שמפו סילבר לשיקום שיער בלונדיני – 500ml - אריזת מילוי",
        price: 220,
        image: "../images/ShampooAndConditioner/3.webp",
        Text: "מרכך סילבר bust your brass האהוב – עכשיו בפורמולה משופרת לשיקום השיער!",
        Text1: "הסוף לגווני החלודה בעזרת מרכך סילבר לבלונד:",
        Text2: "הדרך לשיקום וטיפול קבוע בשיער מובהר, כסוף או אפרפר. ",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 7,
        categoryId: 2,
        name: "Bust your brass שמפו סילבר לשיקום שיער בלונדיני – 275ml",
        price: 229,
        image: "../images/ShampooAndConditioner/4.webp",
        Text: "מרכך סילבר bust your brass האהוב – עכשיו בפורמולה משופרת לשיקום השיער!",
        Text1: "הסוף לגווני החלודה בעזרת מרכך סילבר לבלונד:",
        Text2: "הדרך לשיקום וטיפול קבוע בשיער מובהר, כסוף או אפרפר. ",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 8,
        categoryId: 2,
        name: "the kure bond repair מרכך לשיקום השיער – 500ml - אריזת מילוי",
        price: 109,
        image: "../images/ShampooAndConditioner/5.webp",
        Text: "מרכך סילבר bust your brass האהוב – עכשיו בפורמולה משופרת לשיקום השיער!",
        Text1: "הסוף לגווני החלודה בעזרת מרכך סילבר לבלונד:",
        Text2: "הדרך לשיקום וטיפול קבוע בשיער מובהר, כסוף או אפרפר. ",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 9,
        categoryId: 2,
        name: "the kure bond repair שמפו לשיקום השיער –",
        price: 229,
        image: "../images/ShampooAndConditioner/6.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 10,
        categoryId: 2,
        name: "the kure bond repair שמפו לשיקום השיער –",
        price: 169,
        image: "../images/ShampooAndConditioner/7.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 11,
        categoryId: 2,
        name: "hydro rush מרכך לחות מוגברת – 60ml - travel",
        price: 177,
        image: "../images/ShampooAndConditioner/8.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 12,
        categoryId: 2,
        name: "hydro rush מרכך לחות מוגברת – 275ml",
        price: 220,
        image: "../images/ShampooAndConditioner/9.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 13,
        categoryId: 2,
        name: "hydro rush שמפו לחות מוגברת",
        price: 309,
        image: "../images/ShampooAndConditioner/10.webp"
    },

    {
        id: 14,
        categoryId: 2,
        name: "normcore מרכך – 500ml - אריזת מילוי",
        price: 359,
        image: "../images/ShampooAndConditioner/11.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 15,
        categoryId: 2,
        name: "normcore מרכך – 275ml",
        price: 229,
        image: "../images/ShampooAndConditioner/12.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 16,
        categoryId: 2,
        name: "normcore שמפו – 60ml - travel size",
        price: 99,
        image: "../images/ShampooAndConditioner/13.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 17,
        categoryId: 2,
        name: "Bust your brass שמפו סילבר לשיקום שיער בלונדיני – 275ml",
        price: 190,
        image: "../images/ShampooAndConditioner/14.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 18,
        categoryId: 2,
        name: "hydro rush מרכך לחות מוגברת – 60ml - travel",
        price: 149,
        image: "../images/ShampooAndConditioner/15.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 19,
        categoryId: 2,
        name: "normcore שמפו – 60ml - travel size",
        price: 80,
        image: "../images/ShampooAndConditioner/16.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 20,
        categoryId: 2,
        name: "normcore מרכך – 275ml",
        price: 159,
        image: "../images/ShampooAndConditioner/17.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "

    },
    {
        id: 21,
        categoryId: 2,
        name: "hydro rush שמפו לחות מוגברת – 500ml -",
        price: 150,
        image: "../images/ShampooAndConditioner/18.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 22,
        categoryId: 2,
        name: "שמפו יבש Perk Up – 269g / 358ml – אריזת חיסכון",
        price: 149,
        image: "../images/ShampooAndConditioner/19.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 23,
        categoryId: 2,
        name: "שמפו יבש Perk Up – 269g / 358ml – אריזת חיסכון",
        price: 149,
        image: "../images/ShampooAndConditioner/20.webp",
        Text: "מוכנה למראה שיער שופע ומלא חיים? שמפו ומרכך big hit כאן בשביל להרים את שיערך לגבהים חדשים!",
        Text1: "הפורמולה מעניקה רעננות מפנקת, לצד תחושה ומראה נקי, כאילו הרגע חפפת.",
        Text2: "*מבוסס על הערכת מומחים של 32 משתתפים.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 24,
        categoryId: 2,
        name: "שמפו ג'לי פילינג מטהר reset",
        // name2: "שמפו לניקוי עמוק, טיהור ואיזון הקרקפת",
        price: 149,
        image: "../images/ShampooAndConditioner/21.webp",
        Text: "כמו עור הפנים, גם עור הקרקפת זקוק ליחס:",
        Text1: "שלבי את השמפו בשגרת הטיפוח השבועית שלך לניקוי עמוק ואיזון.",
        Text2: "השמפו מתאים לכל סוגי הקרקפת: רגילה, שומנית, רגישה, קרקפת יבשה או מגרדת.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 25,
        categoryId: 2,
        name: "The kure מרכך לשיקום השיער",
        price: 69,
        image: "../images/ShampooAndConditioner/22.webp",
        Text: "מרכך the kure מסייע לשקם, לשחזר ולהחיות שיער יבש",
        Text1: "מוצר זה הינו בפורמולה הקלאסית.",
        Text2: "**פריט זה אינו נכלל בהטבות, לא ניתן להשתמש בקופון עבורו",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 26,
        categoryId: 2,
        name: "בקבוק שמפו למילוי חוזר forever friend",
        price: 129.00,
        image: "../images/ShampooAndConditioner/23.webp",
        Text: "בקבוק רב פעמי למילוי חוזר בצבע כתום, מיוצר מפלסטיק ללא BPA וללא EA",
        Text1: "תכולה : 300 מ״ל  |   23 ₪ ל-100 מ״ל",
        Text2: "** הבקבוק מגיע ריק",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 27,
        categoryId: 3,
        name: "soulfood מסכת הזנה – 100ml",
        price: 79.00,
        image: "../images/MasksAndNutrition/2.webp",
        Text: "מסכת הזנה לשיער – מועשרת בשמן אובליפיחה, מעניקה טיפול וריכוך עמוק",
        Text1: "לחידוש והזנת השיער, מעניקה נפח, ברק וגמישות ושומרת על השיער מפני נזקי",
        Text2: "היום יום תוך טיפול בקצוות מפוצלים ומנטרלת חשמל סטטי.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 28,
        categoryId: 3,
        name: "soulfood מסכת הזנה – 500ml",
        price: 189.00,
        image: "../images/MasksAndNutrition/3.webp",
        Text: "מסכת הזנה לשיער – מועשרת בשמן אובליפיחה, מעניקה טיפול וריכוך עמוק",
        Text1: "לחידוש והזנת השיער, מעניקה נפח, ברק וגמישות ושומרת על השיער מפני נזקי",
        Text2: "היום יום תוך טיפול בקצוות מפוצלים ומנטרלת חשמל סטטי.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 29,
        categoryId: 3,
        name: "Hydro Rush מסכת לחות להזנה עמוקה",
        price: 6,
        image: "../images/MasksAndNutrition/4.webp",
        Text: "קחי את הלחות לשלב הבא ותיהני ממהפך לשיער יבש, פריזי וחסר לחות עם",
        Text1: "מסכת הלחות להזנה עמוקה החדשה של amika.",
        Text2: "*נבדק קלינית, לאחר שימוש אחד.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },

    {
        id: 30,
        categoryId: 3,
        name: "dream routine מסכת לילה טיפולית ללחות",
        price: 159.00,
        image: "../images/MasksAndNutrition/5.webp",
        Text: "הגיע זמן לומר לילה טוב לשיער יבש!",
        Text1: "מסכת שיער קלילה לשימוש לפני השינה, להזנת השיער בלחות מוגברת מבלי",
        Text2: "להכתים את הכרית.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 31,
        categoryId: 3,
        name: "the kure מסכה לשיער לשיקום אינטנסיבי –",
        price: 99.00,
        image: "../images/MasksAndNutrition/6.webp",
        Text: "הגיע זמן לומר לילה טוב לשיער יבש!",
        Text1: "מסכת שיער קלילה לשימוש לפני השינה, להזנת השיער בלחות מוגברת מבלי",
        Text2: "להכתים את הכרית.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 32,
        categoryId: 3,
        name: "the kure מסכה לשיער לשיקום אינטנסיבי –",
        price: 239.00,
        image: "../images/MasksAndNutrition/7.webp",
        Text: "מסכה מרוכזת ועשירה בעלת פורמולה ייחודית לשיקום קשרי השערה וחיזוק השיער.",
        Text1: "מסכה משקמת לשיער: מספקת טיפול הזנה ושיקום עמוק ומיידי ומעניקה שיער בריא ורך כמשי.",
        Text2: "הגיע זמן לומר לילה טוב לשיער יבש!",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 33,
        categoryId: 3,
        name: "the kure multi-task מסכה רב-שימושית",
        price: 222.00,
        image: "../images/MasksAndNutrition/8.webp",
        Text: "מסכה מרוכזת ועשירה בעלת פורמולה ייחודית לשיקום קשרי השערה וחיזוק השיער.",
        Text1: "מסכה משקמת לשיער: מספקת טיפול הזנה ושיקום עמוק ומיידי ומעניקה שיער בריא ורך כמשי.",
        Text2: "הגיע זמן לומר לילה טוב לשיער יבש!",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 34,
        categoryId: 3,
        name: "מסכת סילבר bust your brass – 100ml",
        price: 175,
        image: "../images/MasksAndNutrition/9.webp",
        Text: "מסכת סילבר bust your brass לשיקום אינטנסיבי מבית אמיקה היא מסכה",
        Text1: "עשירה ומזינה אשר מנטרלת את גוון החלודה (brass) מהבלונד, משקמת שיער",
        Text2: "פגום ומונעת שבירה עתידית!",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 35,
        categoryId: 3,
        name: "מסכת סילבר bust your brass – 250ml",
        price: 299,
        image: "../images/MasksAndNutrition/10.webp",
        Text: "מסכת סילבר bust your brass לשיקום אינטנסיבי מבית אמיקה היא מסכה",
        Text1: "עשירה ומזינה אשר מנטרלת את גוון החלודה (brass) מהבלונד, משקמת שיער",
        Text2: "פגום ומונעת שבירה עתידית!",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "

    },
    {
        id: 36,
        categoryId: 3,
        name: "flash מסכה לשיער מעניקה ברק",
        price: 189,
        image: "../images/MasksAndNutrition/12.webp",
        Text: "מסכת סילבר bust your brass לשיקום אינטנסיבי מבית אמיקה היא מסכה",
        Text1: "עשירה ומזינה אשר מנטרלת את גוון החלודה (brass) מהבלונד, משקמת שיער",
        Text2: "פגום ומונעת שבירה עתידית!",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 37,
        categoryId: 5,
        name: "מברשת פן חשמלית blow 2.0",
        price: 699,
        image: "../images/ElectricalAppliances/1.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 38,
        categoryId: 5,
        name: "מחליק טיטניום פרימיום the confidante בצבע רוז גולד",
        price: 499,
        image: "../images/ElectricalAppliances/2.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 39,
        categoryId: 5,
        name:"נפח של פן" ,
        price: 699,
        image: "../images/ElectricalAppliances/3.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 40,
        categoryId: 5,
        name: "the confidante מחליק טיטניום פרימיום לשיער",
        price: 499,
        image: "../images/ElectricalAppliances/4.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 41,
        categoryId: 5,
        name: "silk glide מחליק טיטניום גולמי סגול",
        price: 499,
        image: "../images/ElectricalAppliances/5.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 42,
        categoryId:5,
        name: "strand perfect מחליק שיער קרמי – ורוד ",
        price: 499,
        image: "../images/ElectricalAppliances/6.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 43,
        categoryId: 5,
        name: "strand perfect מחליק שיער קרמי – ורוד מסטיק",
        price: 499,
        image: "../images/ElectricalAppliances/7.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 44,
        categoryId: 5,
        name: "strand perfect מחליק שיער קרמי – טורקיז",
        price: 249,
        image: "../images/ElectricalAppliances/8.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 45,
        categoryId: 5,
        name: "ערכת mighty mini curler",
        price: 999,
        image: "../images/ElectricalAppliances/9.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 46,
        categoryId: 5,
        name: "מסלסל שיער ג'מבו",
        price: 549,
        image: "../images/ElectricalAppliances/10.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 47,
        categoryId: 5,
        name: "ראש מסלסל מתחלף – 18-25 מ",
        price: 149,
        image: "../images/ElectricalAppliances/11.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 48,
        categoryId: 5,
        name: "מסלסל שיער high tide deep waver",
        price: 549,
        image: "../images/ElectricalAppliances/12.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 49,
        categoryId: 5,
        name: "אש מסלסל מתחלף – 25  עם קליפס",
        price: 149,
        image: "../images/ElectricalAppliances/13.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 50,
        categoryId: 5,
        name: "ראש מסלסל מתחלף – 25-32 מ",
        price: 366,
        image: "../images/ElectricalAppliances/14.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 51,
        categoryId: 5,
        name: "מסלסל שיער מיני ורוד פרינט",
        price:199,
        image: "../images/ElectricalAppliances/15.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 52,
        categoryId: 5,
        name: "מסלסל שיער פן ורוד מסטיק",
        price: 399,
        image: "../images/ElectricalAppliances/16.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 53,
        categoryId: 5,
        name: "הפן המושלם – הקוסם נטול סיליקונים",
        price: 819,
        image: "../images/ElectricalAppliances/17.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 54,
        categoryId: 5,
        name: "מייבש שיער power cloud ורוד 2300W",
        price: 399,
        image: "../images/ElectricalAppliances/18.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 55,
        categoryId: 5,
        name: "מייבש שיער power cloud סגול 2300W",
        price:  399.00,
        image: "../images/ElectricalAppliances/19.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 56,
        categoryId: 5,
        name:" דיפיוזר טיפולי מתקפל – pink",
        price: 99,
        image: "../images/ElectricalAppliances/20.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 57,
        categoryId: 5,
        name: "כפפה למחליק",
        price: 20,
        image: "../images/ElectricalAppliances/21.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
    },
    {
        id: 58,
        categoryId: 5,
        name: "נרתיק עמיד בחום",
        price: 59,
        image: "../images/ElectricalAppliances/22.webp",
        Text: "**מנגנונים משופרים להארכת חיי המכשיר",
        Text1: "לתוצאות מקסימליות יש להשתמש במברשת על שיער לח או שיער שיובש במגבת.",
        Text2: "",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
    {
        id: 59,
        categoryId: 4,
        name: "מסכת אנטי-פריז smooth over",
        price: 239,
        image: "../images/HeatProtection/1.webp",
       Text: "הפורמולה המשובחת של הקרם עשירה ברכיבים מזינים, בשילוב פיגמנט סגול",
        Text1: "לנטרול גווני חלודה מהבלונד, ופועלת להתרת קשרים, הפחתת פריזיות, מגנה מחום,",
        Text2: "מסייעת להשיב לשיער את היכולת לשמר לחות ומעניקה לו מרקם רך וחלק.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
{
        id: 60,
        categoryId: 4,
        name: "soulfood מסכת הזנה – 100ml",
        price: 289,
        image: "../images/HeatProtection/2.webp",
        Text: "הפורמולה המשובחת של הקרם עשירה ברכיבים מזינים, בשילוב פיגמנט סגול",
        Text1: "לנטרול גווני חלודה מהבלונד, ופועלת להתרת קשרים, הפחתת פריזיות, מגנה מחום,",
        Text2: "מסייעת להשיב לשיער את היכולת לשמר לחות ומעניקה לו מרקם רך וחלק.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
    {
        id: 61,
        categoryId: 4,
        name: "ספריי נפח rising star",
        price: 250,
        image: "../images/HeatProtection/3.webp",
       Text: "הפורמולה המשובחת של הקרם עשירה ברכיבים מזינים, בשילוב פיגמנט סגול",
        Text1: "לנטרול גווני חלודה מהבלונד, ופועלת להתרת קשרים, הפחתת פריזיות, מגנה מחום,",
        Text2: "מסייעת להשיב לשיער את היכולת לשמר לחות ומעניקה לו מרקם רך וחלק.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
    {
        id: 62,
        categoryId: 4,
        name: "the wizard פריימר הקוסם - נטול סיליקון –",
        price: 220,
        image: "../images/HeatProtection/4.webp",
        Text: "הפורמולה המשובחת של הקרם עשירה ברכיבים מזינים, בשילוב פיגמנט סגול",
        Text1: "לנטרול גווני חלודה מהבלונד, ופועלת להתרת קשרים, הפחתת פריזיות, מגנה מחום,",
        Text2: "מסייעת להשיב לשיער את היכולת לשמר לחות ומעניקה לו מרקם רך וחלק.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
    {
        id: 63,
        categoryId: 4,
        name: "the wizard פריימר הקוסם – 118ml",
        price: 179,
        image: "../images/HeatProtection/5.webp",
        Text: "הפורמולה המשובחת של הקרם עשירה ברכיבים מזינים, בשילוב פיגמנט סגול",
        Text1: "לנטרול גווני חלודה מהבלונד, ופועלת להתרת קשרים, הפחתת פריזיות, מגנה מחום,",
        Text2: "מסייעת להשיב לשיער את היכולת לשמר לחות ומעניקה לו מרקם רך וחלק.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
    {
        id: 64,
        categoryId: 4,
        name: "סרום לשיער מגן חום blockade –",
        price: 250,
        image: "../images/HeatProtection/6.webp",
        Text: "הפורמולה המשובחת של הקרם עשירה ברכיבים מזינים, בשילוב פיגמנט סגול",
        Text1: "לנטרול גווני חלודה מהבלונד, ופועלת להתרת קשרים, הפחתת פריזיות, מגנה מחום,",
        Text2: "מסייעת להשיב לשיער את היכולת לשמר לחות ומעניקה לו מרקם רך וחלק.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
    {
        id: 65,
        categoryId: 4,
        name: "the shield ספריי מגן לחות – 150g / 218ml",
        price: 189,
       image: "../images/HeatProtection/7.webp",
       Text: "הפורמולה המשובחת של הקרם עשירה ברכיבים מזינים, בשילוב פיגמנט סגול",
        Text1: "לנטרול גווני חלודה מהבלונד, ופועלת להתרת קשרים, הפחתת פריזיות, מגנה מחום,",
        Text2: "מסייעת להשיב לשיער את היכולת לשמר לחות ומעניקה לו מרקם רך וחלק.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
    {
        id: 66,
        categoryId: 4,
        name: "מארז un.done star",
        price: 559,
        image: "../images/HeatProtection/8.webp",
     Text: "הפורמולה המשובחת של הקרם עשירה ברכיבים מזינים, בשילוב פיגמנט סגול",
        Text1: "לנטרול גווני חלודה מהבלונד, ופועלת להתרת קשרים, הפחתת פריזיות, מגנה מחום,",
        Text2: "מסייעת להשיב לשיער את היכולת לשמר לחות ומעניקה לו מרקם רך וחלק.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
    {
        id: 67,
        categoryId: 4,
        name: "Water sign שמן הזנה לשיער ללחות עמוקה",
        price: 220,
        image: "../images/HeatProtection/9.webp",
        Text: "הפורמולה המשובחת של הקרם עשירה ברכיבים מזינים, בשילוב פיגמנט סגול",
        Text1: "לנטרול גווני חלודה מהבלונד, ופועלת להתרת קשרים, הפחתת פריזיות, מגנה מחום,",
        Text2: "מסייעת להשיב לשיער את היכולת לשמר לחות ומעניקה לו מרקם רך וחלק.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
    {
        id: 68,
        categoryId: 4,
        name: "supernova קרם לחות וברק",
        price: 75,
        image: "../images/HeatProtection/10.webp",
        Text: "הפורמולה המשובחת של הקרם עשירה ברכיבים מזינים, בשילוב פיגמנט סגול",
        Text1: "לנטרול גווני חלודה מהבלונד, ופועלת להתרת קשרים, הפחתת פריזיות, מגנה מחום,",
        Text2: "מסייעת להשיב לשיער את היכולת לשמר לחות ומעניקה לו מרקם רך וחלק.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
     {
        id: 69,
        categoryId: 6,
        name: "סט blonde boogie",
        price:89,
        image: "../images/KitsAndGifts/1.webp",
        Text: "המתנה המושלמת לשיער בלונדיני, כסוף או אפור – הזקוק לתיקון הגוון ולשיקום עמוק.",
        Text1: "המארז מכיל שמפו סילבר, מרכך סילבר ומסכת סילבר לתיקון גוון הבלונד ושיקום השיער",
        Text2: "**פריט זה אינו נכלל בהטבות, לא ניתן להשתמש בקופון עבורו.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
     {
        id: 70,
        categoryId: 6,
        name: "סט good vibes only",
        price:89,
        image: "../images/KitsAndGifts/2.webp",
        Text: "המתנה המושלמת לשיער בלונדיני, כסוף או אפור – הזקוק לתיקון הגוון ולשיקום עמוק.",
        Text1: "המארז מכיל שמפו סילבר, מרכך סילבר ומסכת סילבר לתיקון גוון הבלונד ושיקום השיער",
        Text2: "**פריט זה אינו נכלל בהטבות, לא ניתן להשתמש בקופון עבורו.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
     {
        id: 71,
        categoryId: 6,
        name: "Gift Card",
        price:89,
        image: "../images/KitsAndGifts/3.webp",
        Text: "המתנה המושלמת לשיער בלונדיני, כסוף או אפור – הזקוק לתיקון הגוון ולשיקום עמוק.",
        Text1: "המארז מכיל שמפו סילבר, מרכך סילבר ומסכת סילבר לתיקון גוון הבלונד ושיקום השיער",
        Text2: "**פריט זה אינו נכלל בהטבות, לא ניתן להשתמש בקופון עבורו.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
     {
        id: 72,
        categoryId: 6,
        name: "אריזת מתנה גדולה",
        price:89,
        image: "../images/KitsAndGifts/4.webp",
        Text: "המתנה המושלמת לשיער בלונדיני, כסוף או אפור – הזקוק לתיקון הגוון ולשיקום עמוק.",
        Text1: "המארז מכיל שמפו סילבר, מרכך סילבר ומסכת סילבר לתיקון גוון הבלונד ושיקום השיער",
        Text2: "**פריט זה אינו נכלל בהטבות, לא ניתן להשתמש בקופון עבורו.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
     {
        id: 73,
        categoryId: 6,
        name: "אריזת מתנה קטנה",
        price:89,
       image: "../images/KitsAndGifts/4.webp",
        Text: "המתנה המושלמת לשיער בלונדיני, כסוף או אפור – הזקוק לתיקון הגוון ולשיקום עמוק.",
        Text1: "המארז מכיל שמפו סילבר, מרכך סילבר ומסכת סילבר לתיקון גוון הבלונד ושיקום השיער",
        Text2: "**פריט זה אינו נכלל בהטבות, לא ניתן להשתמש בקופון עבורו.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    },
     {
        id: 74,
        categoryId: 6,
        name: "מארז פינק פאוור",
        price:89,
        image: "../images/KitsAndGifts/5.webp",
        Text: "המתנה המושלמת לשיער בלונדיני, כסוף או אפור – הזקוק לתיקון הגוון ולשיקום עמוק.",
        Text1: "המארז מכיל שמפו סילבר, מרכך סילבר ומסכת סילבר לתיקון גוון הבלונד ושיקום השיער",
        Text2: "**פריט זה אינו נכלל בהטבות, לא ניתן להשתמש בקופון עבורו.",
        Text3: "*התמונות להמחשה בלבד",
        Text4: "משלוח חינם ברכישה מעל ₪299 "
       
    }
     
    



];
//שמירת המערכים במחסנית
localStorage.setItem("products", JSON.stringify(products));
localStorage.setItem("categories", JSON.stringify(categories));